{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AutoPrefixTool",
			"Children": [
				{
					"Source": {
						"Text": "  操作"
					},
					"Translation": {
						"Text": "  Operation"
					},
					"Key": "ColOp"
				},
				{
					"Source": {
						"Text": "+ 添加规则"
					},
					"Translation": {
						"Text": "+ Add Rule"
					},
					"Key": "AddRuleBtn"
				},
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "Discard current changes and re-read all configurations from JSON"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套前缀"
					},
					"Translation": {
						"Text": "Delete this set of prefixes from JSON"
					},
					"Key": "DeleteSetBtnTip"
				},
				{
					"Source": {
						"Text": "从项目设置读取"
					},
					"Translation": {
						"Text": "Read from Project Settings"
					},
					"Key": "PullBtn"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在下方规则表里选择 目标类 及其 前缀\n  2. 填好表后可点击 保存配置 保存当前配置\n  3. 点 应用到项目设置 把当前这套写进 DefaultGame.ini 并生效\n  4. 之后新建蓝图/资产时，重命名输入框的默认值就会变成对应前缀\n  5. 改乱了可点 重置默认值 ，把当前配置恢复为默认前缀（需再点 应用到项目设置 才生效）\n  6. 本插件只接管蓝图/资产的前缀；C++ 类保持引擎原生"
					},
					"Translation": {
						"Text": "Usage:\n  1. In the rule table below, select the Target Class and its Prefix\n  2. After filling the table, click Save Configuration to save the current configuration\n  3. Click Apply to Project Settings to write this set into DefaultGame.ini and take effect\n  4. When creating new Blueprints/assets afterwards, the default value in the rename box becomes the corresponding prefix\n  5. If messed up, click Reset to Defaults to restore the current configuration to the default prefix (requires clicking Apply to Project Settings again to take effect)\n  6. This plugin only manages prefixes for Blueprints/assets; C++ classes remain native to the engine"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "Save Configuration"
					},
					"Key": "SaveSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "Delete"
					},
					"Key": "DeleteSetBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "Delete"
					},
					"Key": "RemoveRuleBtn"
				},
				{
					"Source": {
						"Text": "删除这条规则"
					},
					"Translation": {
						"Text": "Delete this rule"
					},
					"Key": "RemoveRuleBtnTip"
				},
				{
					"Source": {
						"Text": "前缀"
					},
					"Translation": {
						"Text": "Prefix"
					},
					"Key": "ColPrefix"
				},
				{
					"Source": {
						"Text": "前缀配置: "
					},
					"Translation": {
						"Text": "Prefix Configuration: "
					},
					"Key": "SetLabel"
				},
				{
					"Source": {
						"Text": "如 BP_"
					},
					"Translation": {
						"Text": "e.g. BP_"
					},
					"Key": "PrefixHint"
				},
				{
					"Source": {
						"Text": "应用到项目设置"
					},
					"Translation": {
						"Text": "Apply to Project Settings"
					},
					"Key": "ApplyBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "Open Configuration Folder"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把当前配置写入 DefaultGame.ini，更新 项目设置 -> 插件 -> AutoPrefix "
					},
					"Translation": {
						"Text": "Write the current configuration to DefaultGame.ini and update Project Settings -> Plugins -> AutoPrefix"
					},
					"Key": "ApplyBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置的规则恢复为内置默认（常见 UE 命名约定），仅在内存中生效，点 保存配置 可持久化"
					},
					"Translation": {
						"Text": "Restore the current configuration's rules to the built-in defaults (common UE naming conventions). Takes effect in memory only; click Save Configuration to persist."
					},
					"Key": "ResetBtnTip"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "Append the current configuration to JSON; overwrite if the name already exists"
					},
					"Key": "SaveSetBtnTip"
				},
				{
					"Source": {
						"Text": "把项目设置里现有的配置反向读回面板"
					},
					"Translation": {
						"Text": "Read the existing configuration from Project Settings back into the panel"
					},
					"Key": "PullBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "New Empty Configuration"
					},
					"Key": "NewSetBtn"
				},
				{
					"Source": {
						"Text": "清空当前规则表，从零开始配置一套新的前缀"
					},
					"Translation": {
						"Text": "Clear the current rule table and configure a new set of prefixes from scratch"
					},
					"Key": "NewSetBtnTip"
				},
				{
					"Source": {
						"Text": "目标类（蓝图填父类 / 资产填资产类型）"
					},
					"Translation": {
						"Text": "Target Class (Blueprint: parent class / Asset: asset type)"
					},
					"Key": "ColClass"
				},
				{
					"Source": {
						"Text": "这套前缀保存时使用的名字"
					},
					"Translation": {
						"Text": "The name used when saving this set of prefixes"
					},
					"Key": "SetNameHint"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "Configuration Name: "
					},
					"Key": "SetNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "Reload"
					},
					"Key": "ReloadBtn"
				},
				{
					"Source": {
						"Text": "重置默认值"
					},
					"Translation": {
						"Text": "Reset to Defaults"
					},
					"Key": "ResetBtn"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Translation": {
						"Text": "SuBaseToolsBox_PluginCommand"
					},
					"Key": "SuBaseToolsBox_PluginCommand"
				}
			]
		},
		{
			"Namespace": "FToolsBoxModule",
			"Children": [
				{
					"Source": {
						"Text": "工具箱"
					},
					"Translation": {
						"Text": "Toolbox"
					},
					"Key": "ToolsBox"
				},
				{
					"Source": {
						"Text": "物理摆放生成"
					},
					"Translation": {
						"Text": "Physics Placement Spawn"
					},
					"Key": "PhysicsPlacerSpawnMode"
				},
				{
					"Source": {
						"Text": "详情"
					},
					"Translation": {
						"Text": "Details"
					},
					"Key": "ToolBoxAuthor"
				}
			]
		},
		{
			"Namespace": "Info",
			"Children": [
				{
					"Source": {
						"Text": "关于"
					},
					"Translation": {
						"Text": "About"
					},
					"Key": "DetailsTitle"
				},
				{
					"Source": {
						"Text": "制作不易，恳求打赏，谢谢喵ฅ^•ﻌ•^ฅ"
					},
					"Translation": {
						"Text": "It was not easy to make. Please consider a donation. Thank you~ ฅ^•ﻌ•^ฅ"
					},
					"Key": "Donate"
				},
				{
					"Source": {
						"Text": "前往bilibili"
					},
					"Translation": {
						"Text": "Go to bilibili"
					},
					"Key": "GoBilibili"
				},
				{
					"Source": {
						"Text": "前往github"
					},
					"Translation": {
						"Text": "Go to GitHub"
					},
					"Key": "GoGithub"
				}
			]
		},
		{
			"Namespace": "MaterialTransferTool",
			"Children": [
				{
					"Source": {
						"Text": "丢弃当前修改，从 JSON 重新读取全部配置"
					},
					"Translation": {
						"Text": "Discard current changes and re-read all configurations from JSON"
					},
					"Key": "ReloadBtnTip"
				},
				{
					"Source": {
						"Text": "两者都不勾选：按源材质类型生成（实例→实例，材质类→材质类）。"
					},
					"Translation": {
						"Text": "If neither is checked: generate by source material type (Instance -> Instance, Material Class -> Material Class)."
					},
					"Key": "CkeckTip"
				},
				{
					"Source": {
						"Text": "从 JSON 中删除这套配置"
					},
					"Translation": {
						"Text": "Delete this configuration from JSON"
					},
					"Key": "DeleteConfigBtnTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择需要继承自的母材质或材质实例类\n  2. 内容浏览器中选择一个或多个需要被转移参数值的材质实例或材质类\n  3. 配置可在下拉框保存多套、随时切换；点 开始转移参数 后生成新材质并赋值参数\n"
					},
					"Translation": {
						"Text": "Usage:\n  1. Select the parent material or material instance class to inherit from\n  2. In the Content Browser, select one or more material instances or material classes whose parameter values need to be transferred\n  3. Configurations can be saved as multiple sets in the dropdown and switched at any time; after clicking Start Transferring Parameters, a new material is generated and parameters are assigned\n"
					},
					"Key": "MaterialAttributeTransferHelper"
				},
				{
					"Source": {
						"Text": "例如 /Game/Materials/Generated"
					},
					"Translation": {
						"Text": "e.g. /Game/Materials/Generated"
					},
					"Key": "PathHint"
				},
				{
					"Source": {
						"Text": "保存到各自文件夹中"
					},
					"Translation": {
						"Text": "Save to respective folders"
					},
					"Key": "SaveToFolderTip"
				},
				{
					"Source": {
						"Text": "保存配置"
					},
					"Translation": {
						"Text": "Save Configuration"
					},
					"Key": "SaveConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "Delete"
					},
					"Key": "DeleteConfigBtn"
				},
				{
					"Source": {
						"Text": "删除"
					},
					"Translation": {
						"Text": "Delete"
					},
					"Key": "RowDelBtn"
				},
				{
					"Source": {
						"Text": "删除这一行映射"
					},
					"Translation": {
						"Text": "Delete this mapping row"
					},
					"Key": "RowDelTip"
				},
				{
					"Source": {
						"Text": "开始转移参数"
					},
					"Translation": {
						"Text": "Start Transferring Parameters"
					},
					"Key": "RunBtn"
				},
				{
					"Source": {
						"Text": "打开配置"
					},
					"Translation": {
						"Text": "Open Configuration"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "Open Configuration Folder"
					},
					"Key": "OpenFolderBtnTip"
				},
				{
					"Source": {
						"Text": "执行日志:"
					},
					"Translation": {
						"Text": "Execution Log:"
					},
					"Key": "LogTitle"
				},
				{
					"Source": {
						"Text": "把当前配置追加保存到 JSON，同名则覆盖该配置"
					},
					"Translation": {
						"Text": "Append the current configuration to JSON; overwrite if the name already exists"
					},
					"Key": "SaveConfigBtnTip"
				},
				{
					"Source": {
						"Text": "新建空配置"
					},
					"Translation": {
						"Text": "New Empty Configuration"
					},
					"Key": "NewConfigBtn"
				},
				{
					"Source": {
						"Text": "母材质参数名 (新)"
					},
					"Translation": {
						"Text": "Parent Material Parameter Name (New)"
					},
					"Key": "TitleL"
				},
				{
					"Source": {
						"Text": "添加参数行"
					},
					"Translation": {
						"Text": "Add Parameter Row"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "清空参数行"
					},
					"Translation": {
						"Text": "Clear Parameter Rows"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "清空当前配置，从零开始配置一套新的转移方案"
					},
					"Translation": {
						"Text": "Clear the current configuration and start configuring a new transfer scheme from scratch"
					},
					"Key": "NewConfigBtnTip"
				},
				{
					"Source": {
						"Text": "源材质变量名 (旧)"
					},
					"Translation": {
						"Text": "Source Material Variable Name (Old)"
					},
					"Key": "TitleR"
				},
				{
					"Source": {
						"Text": "生成保存路径: "
					},
					"Translation": {
						"Text": "Generated Save Path: "
					},
					"Key": "PathLabel"
				},
				{
					"Source": {
						"Text": "目标母材质: "
					},
					"Translation": {
						"Text": "Target Parent Material: "
					},
					"Key": "TargetLabel"
				},
				{
					"Source": {
						"Text": "移除所有映射行"
					},
					"Translation": {
						"Text": "Remove all mapping rows"
					},
					"Key": "ClearBtnTip"
				},
				{
					"Source": {
						"Text": "获取当前路径"
					},
					"Translation": {
						"Text": "Get Current Path"
					},
					"Key": "GetPathBtn"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质实例"
					},
					"Translation": {
						"Text": "Generate material instance uniformly after conversion"
					},
					"Key": "GenInstChk"
				},
				{
					"Source": {
						"Text": "转换后统一生成材质类"
					},
					"Translation": {
						"Text": "Generate material class uniformly after conversion"
					},
					"Key": "GenMatChk"
				},
				{
					"Source": {
						"Text": "这套配置保存时使用的名字"
					},
					"Translation": {
						"Text": "The name used when saving this configuration"
					},
					"Key": "ConfigNameHint"
				},
				{
					"Source": {
						"Text": "配置: "
					},
					"Translation": {
						"Text": "Configuration: "
					},
					"Key": "ConfigLabel"
				},
				{
					"Source": {
						"Text": "配置名称: "
					},
					"Translation": {
						"Text": "Configuration Name: "
					},
					"Key": "ConfigNameLabel"
				},
				{
					"Source": {
						"Text": "重新加载"
					},
					"Translation": {
						"Text": "Reload"
					},
					"Key": "ReloadBtn"
				}
			]
		},
		{
			"Namespace": "PhysicsPlacerTool",
			"Children": [
				{
					"Source": {
						"Text": "+ 添加网格"
					},
					"Translation": {
						"Text": "+ Add Mesh"
					},
					"Key": "AddMeshBtn"
				},
				{
					"Source": {
						"Text": "X"
					},
					"Translation": {
						"Text": "X"
					},
					"Key": "OffX"
				},
				{
					"Source": {
						"Text": "Y"
					},
					"Translation": {
						"Text": "Y"
					},
					"Key": "OffY"
				},
				{
					"Source": {
						"Text": "Z"
					},
					"Translation": {
						"Text": "Z"
					},
					"Key": "OffZ"
				},
				{
					"Source": {
						"Text": "不勾选则按列表顺序生成"
					},
					"Translation": {
						"Text": "If unchecked, spawn in list order"
					},
					"Key": "RandomSpawnTip"
				},
				{
					"Source": {
						"Text": "从生成列表移除该网格"
					},
					"Translation": {
						"Text": "Remove this mesh from the spawn list"
					},
					"Key": "RemoveSpawnTip"
				},
				{
					"Source": {
						"Text": "位置回溯"
					},
					"Translation": {
						"Text": "Position Rollback"
					},
					"Key": "RestoreBtn"
				},
				{
					"Source": {
						"Text": "位置回溯（摆位存档）"
					},
					"Translation": {
						"Text": "Position Rollback (Pose Archive)"
					},
					"Key": "PoseTitle"
				},
				{
					"Source": {
						"Text": "保存当前位置"
					},
					"Translation": {
						"Text": "Save Current Position"
					},
					"Key": "SavePoseBtn"
				},
				{
					"Source": {
						"Text": "保存时使用的名字，可自定义"
					},
					"Translation": {
						"Text": "The name used when saving; customizable"
					},
					"Key": "PoseNameHint"
				},
				{
					"Source": {
						"Text": "停下物理模拟，物体保留在当前（掉落到的）位置"
					},
					"Translation": {
						"Text": "Stop the physics simulation; objects remain at their current (fallen) positions"
					},
					"Key": "StopBtnTip"
				},
				{
					"Source": {
						"Text": "停止模拟"
					},
					"Translation": {
						"Text": "Stop Simulation"
					},
					"Key": "StopBtn"
				},
				{
					"Source": {
						"Text": "光标检测地面，点击生成物理物体"
					},
					"Translation": {
						"Text": "Cursor detects ground; click to spawn a physics object"
					},
					"Key": "SpawnTip"
				},
				{
					"Source": {
						"Text": "删除存档"
					},
					"Translation": {
						"Text": "Delete Archive"
					},
					"Key": "DeletePoseBtn"
				},
				{
					"Source": {
						"Text": "可从内容浏览器中拖入添加"
					},
					"Translation": {
						"Text": "You can drag and drop from the Content Browser to add"
					},
					"Key": "DropHint"
				},
				{
					"Source": {
						"Text": "可多选，勾选框控制是否生成；可从内容浏览器拖入网格"
					},
					"Translation": {
						"Text": "Multiple selection allowed; checkbox controls whether to spawn; meshes can be dragged in from the Content Browser"
					},
					"Key": "MeshListTip"
				},
				{
					"Source": {
						"Text": "启动模拟"
					},
					"Translation": {
						"Text": "Start Simulation"
					},
					"Key": "StartBtn"
				},
				{
					"Source": {
						"Text": "基准偏移(米)"
					},
					"Translation": {
						"Text": "Base Offset (meters)"
					},
					"Key": "BaseOffTitle"
				},
				{
					"Source": {
						"Text": "存档名称: "
					},
					"Translation": {
						"Text": "Archive Name: "
					},
					"Key": "PoseNameLabel"
				},
				{
					"Source": {
						"Text": "打开配置文件夹"
					},
					"Translation": {
						"Text": "Open Configuration Folder"
					},
					"Key": "OpenFolderBtn"
				},
				{
					"Source": {
						"Text": "把列表里物体的 位置/旋转/缩放 记成一份带名字的摆位（同名覆盖，不同名追加）"
					},
					"Translation": {
						"Text": "Record the position/rotation/scale of objects in the list as a named pose (overwrite if same name, append if different)"
					},
					"Key": "SavePoseBtnTip"
				},
				{
					"Source": {
						"Text": "把当前视口里选中的 Actor 加入下方列表"
					},
					"Translation": {
						"Text": "Add the currently selected actors in the viewport to the list below"
					},
					"Key": "CaptureBtnTip"
				},
				{
					"Source": {
						"Text": "把选中的那套摆位重新套回当前关卡里标签匹配的物体"
					},
					"Translation": {
						"Text": "Re-apply the selected pose to the objects with matching tags in the current level"
					},
					"Key": "RestoreBtnTip"
				},
				{
					"Source": {
						"Text": "模拟速度系数: "
					},
					"Translation": {
						"Text": "Simulation Speed Factor: "
					},
					"Key": "SimSpeedLabel"
				},
				{
					"Source": {
						"Text": "正在模拟..."
					},
					"Translation": {
						"Text": "Simulating..."
					},
					"Key": "SimulatingBtn"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "Clear List"
					},
					"Key": "ClearBtn"
				},
				{
					"Source": {
						"Text": "物理摆放工具：\n  1. 进入  生成模式  后，在视口里移动光标会从光标向前检测地面，点击即在该处生成物理物体（带偏移，默认上方 2 米掉落）。Alt+点击不生成。\n  2. 生成模式支持多个网格：从内容浏览器把 StaticMesh 拖到  生成网格列表  即可加入\n  3. 或在视口里框选/点选若干物体对象，点 获取编辑器选中 加入下方列表，再 启动模拟 让它们自由掉落；停止模拟 停下并保留当前位置。\n  4. 模拟前/中/后都可  保存当前位置  记成一份带名字的摆位；不理想时用 位置回溯 返回保存时位置。\n  （物体需带网格等 PrimitiveComponent；模拟时物体会被设为可移动并开启重力）"
					},
					"Translation": {
						"Text": "Physics Placement Tool:\n  1. After entering Spawn Mode, moving the cursor in the viewport detects the ground ahead; clicking spawns a physics object there (with offset, defaults to dropping from 2 meters above). Alt+click does not spawn.\n  2. Spawn Mode supports multiple meshes: drag a StaticMesh from the Content Browser into the Spawn Mesh List to add it.\n  3. Or box/click-select several objects in the viewport, click Get Editor Selection to add them to the list below, then Start Simulation to let them fall freely; Stop Simulation stops and keeps the current position.\n  4. Before/during/after simulation you can Save Current Position to record a named pose; if unsatisfactory, use Position Rollback to return to the saved position.\n  (Objects need a mesh or other PrimitiveComponent; during simulation they are set movable and gravity is enabled)"
					},
					"Key": "Help"
				},
				{
					"Source": {
						"Text": "物理摆放模拟"
					},
					"Translation": {
						"Text": "Physics Placement Simulation"
					},
					"Key": "SimRealtimeOverride"
				},
				{
					"Source": {
						"Text": "物理模拟"
					},
					"Translation": {
						"Text": "Physics Simulation"
					},
					"Key": "SimTitle"
				},
				{
					"Source": {
						"Text": "生成模式"
					},
					"Translation": {
						"Text": "Spawn Mode"
					},
					"Key": "SpawnTitle"
				},
				{
					"Source": {
						"Text": "生成网格列表"
					},
					"Translation": {
						"Text": "Spawn Mesh List"
					},
					"Key": "MeshListTitle"
				},
				{
					"Source": {
						"Text": "生成选项"
					},
					"Translation": {
						"Text": "Spawn Options"
					},
					"Key": "SpawnOptTitle"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "Remove"
					},
					"Key": "RemoveActorBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "Remove"
					},
					"Key": "RemoveSpawnBtn"
				},
				{
					"Source": {
						"Text": "获取编辑器选中"
					},
					"Translation": {
						"Text": "Get Editor Selection"
					},
					"Key": "CaptureBtn"
				},
				{
					"Source": {
						"Text": "让列表里的物体开启物理、开始自由掉落"
					},
					"Translation": {
						"Text": "Enable physics on the objects in the list and let them fall freely"
					},
					"Key": "StartBtnTip"
				},
				{
					"Source": {
						"Text": "进入后在视口点击地面即生成物理物体；Alt+点击不生成"
					},
					"Translation": {
						"Text": "After entering, click the ground in the viewport to spawn a physics object; Alt+click does not spawn"
					},
					"Key": "SpawnBtnTip"
				},
				{
					"Source": {
						"Text": "进入生成模式"
					},
					"Translation": {
						"Text": "Enter Spawn Mode"
					},
					"Key": "EnterSpawnBtn"
				},
				{
					"Source": {
						"Text": "追加一个默认立方体条目（也可从内容浏览器拖入具体网格）"
					},
					"Translation": {
						"Text": "Add a default cube entry (you can also drag a specific mesh from the Content Browser)"
					},
					"Key": "AddMeshBtnTip"
				},
				{
					"Source": {
						"Text": "退出生成模式"
					},
					"Translation": {
						"Text": "Exit Spawn Mode"
					},
					"Key": "ExitSpawnBtn"
				},
				{
					"Source": {
						"Text": "选择场景物体"
					},
					"Translation": {
						"Text": "Select Scene Objects"
					},
					"Key": "SelTitle"
				},
				{
					"Source": {
						"Text": "选择存档: "
					},
					"Translation": {
						"Text": "Select Archive: "
					},
					"Key": "PoseLabel"
				},
				{
					"Source": {
						"Text": "随机偏移系数: "
					},
					"Translation": {
						"Text": "Random Offset Factor: "
					},
					"Key": "RandOffLabel"
				},
				{
					"Source": {
						"Text": "随机生成网格"
					},
					"Translation": {
						"Text": "Random Mesh Spawn"
					},
					"Key": "RandomSpawnTxt"
				},
				{
					"Source": {
						"Text": "（给生成位置叠加 ±该值的随机抖动，单位厘米）"
					},
					"Translation": {
						"Text": "(Adds +/- this value of random jitter to the spawn position, in centimeters)"
					},
					"Key": "RandOffUnit"
				}
			]
		},
		{
			"Namespace": "SAAU",
			"Children": [
				{
					"Source": {
						"Text": "为选中的骨骼网格体批量应用动画修饰符"
					},
					"Translation": {
						"Text": "Batch apply animation modifiers to the selected skeletal meshes"
					},
					"Key": "AddAnimationModifyDesc"
				},
				{
					"Source": {
						"Text": "批量处理动画修饰符"
					},
					"Translation": {
						"Text": "Batch Process Animation Modifiers"
					},
					"Key": "BatchModTx"
				},
				{
					"Source": {
						"Text": "批量添加"
					},
					"Translation": {
						"Text": "Batch Add"
					},
					"Key": "ApplyOnly"
				},
				{
					"Source": {
						"Text": "批量添加动画修饰符并应用"
					},
					"Translation": {
						"Text": "Batch Add Animation Modifiers and Apply"
					},
					"Key": "AddAnimationModify"
				},
				{
					"Source": {
						"Text": "批量添加并应用"
					},
					"Translation": {
						"Text": "Batch Add and Apply"
					},
					"Key": "ApplyFull"
				},
				{
					"Source": {
						"Text": "清空列表"
					},
					"Translation": {
						"Text": "Clear List"
					},
					"Key": "ClearStaged"
				},
				{
					"Source": {
						"Text": "相关操作请在资产（或场景Actor）右键菜单中脚本操作中查看\n 若是没有请自行创建类继承自AssetAction和ActorAction"
					},
					"Translation": {
						"Text": "Please view the related operations in the Scripted Actions of the right-click context menu for assets (or scene Actors).\n If not available, create a class that inherits from AssetAction or ActorAction yourself."
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "确认选择"
					},
					"Translation": {
						"Text": "Confirm Selection"
					},
					"Key": "AddBtn"
				},
				{
					"Source": {
						"Text": "选择: "
					},
					"Translation": {
						"Text": "Select: "
					},
					"Key": "SelectLabel"
				},
				{
					"Source": {
						"Text": "（已选列表）"
					},
					"Translation": {
						"Text": "(Selected List)"
					},
					"Key": "StagedHeader"
				}
			]
		},
		{
			"Namespace": "SBlankTemplateTool",
			"Children": [
				{
					"Source": {
						"Text": "工具空白模版"
					},
					"Translation": {
						"Text": "Tool Blank Template"
					},
					"Key": "工具空白模版"
				}
			]
		},
		{
			"Namespace": "SImport_MM",
			"Children": [
				{
					"Source": {
						"Text": "/Game/BatchImport/"
					},
					"Translation": {
						"Text": "/Game/BatchImport/"
					},
					"Key": "Hint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "Copy from an existing parent material instance and set texture parameters"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "Task Log:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 选择要导入模型和贴图的文件夹\n  2. 点导入即可\n  还不清楚怎么用可前往作者B站查看使用教程\n"
					},
					"Translation": {
						"Text": "Usage:\n  1. Select the folder containing the models and textures to import\n  2. Click Import to start\n  If you are still unsure how to use it, visit the author's Bilibili for a tutorial\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "Use Parent Material Instance"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "Save Location: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "Create Instance and Apply"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "Prefix:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选时，合并模型拆分后的每个子模型会加上合并模型名作为前缀（如 SM_Chair_Seat）；取消勾选则只保留子模型原名（如 SM_Seat）"
					},
					"Translation": {
						"Text": "When checked, each sub-model after splitting the combined model gets the combined model name as a prefix (e.g. SM_Chair_Seat); when unchecked, only the sub-model's original name is kept (e.g. SM_Seat)"
					},
					"Key": "UseCombinedPrefixTip"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "Suffix:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "Generate a material instance based on the parent material"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "If you use your own custom material, please fill in the parameter names according to the corresponding channels"
					},
					"Key": "ToolTip"
				},
				{
					"Source": {
						"Text": "如果纹理贴图不与模型同一层级下，而是处于同级的文件夹内，请输入统一的此文件夹名称。留空则默认贴图与模型同级。 "
					},
					"Translation": {
						"Text": "If the texture maps are not under the same level as the model but in a sibling folder, enter the unified name of that folder. Leave blank to default to the same level as the model."
					},
					"Key": "Tip"
				},
				{
					"Source": {
						"Text": "导入"
					},
					"Translation": {
						"Text": "Import"
					},
					"Key": "Run"
				},
				{
					"Source": {
						"Text": "批量导入工具"
					},
					"Translation": {
						"Text": "Batch Import Tool"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "拆分模型添加合并模型名前缀"
					},
					"Translation": {
						"Text": "Add combined model name prefix when splitting models"
					},
					"Key": "UseCombinedPrefix"
				},
				{
					"Source": {
						"Text": "浏览"
					},
					"Translation": {
						"Text": "Browse"
					},
					"Key": "B1"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "Clear Log"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "源文件夹: "
					},
					"Translation": {
						"Text": "Source Folder: "
					},
					"Key": "Src"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "Generate Common Parent Material and Instance"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "留空则在模型同级目录找贴图"
					},
					"Translation": {
						"Text": "Leave blank to look for textures in the same directory as the model"
					},
					"Key": "TexHint"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM)的父材质及其对应的实例"
					},
					"Translation": {
						"Text": "Automatically create a parent material with standard parameters (BaseColor, Normal, ORM) and its corresponding instance"
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "Texture Parameter Name Configuration"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "贴图子文件夹名: "
					},
					"Translation": {
						"Text": "Texture Subfolder Name: "
					},
					"Key": "TexFolder"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "Detailed Asset Naming Rules"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "Enter suffix content..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "Select Path"
					},
					"Key": "B2"
				}
			]
		},
		{
			"Namespace": "SSpawnMaterial",
			"Children": [
				{
					"Source": {
						"Text": "/Game/Materials"
					},
					"Translation": {
						"Text": "/Game/Materials"
					},
					"Key": "DstHint"
				},
				{
					"Source": {
						"Text": "从已有父材质实例复制并设置贴图参数"
					},
					"Translation": {
						"Text": "Copy from an existing parent material instance and set texture parameters"
					},
					"Key": "UseMITip"
				},
				{
					"Source": {
						"Text": "任务日志:"
					},
					"Translation": {
						"Text": "Task Log:"
					},
					"Key": "LogLabel"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 在内容浏览器中选中一个或多个纹理贴图（除此之外也可以加选一个或多个模型）\n  2. 在下方设置保存路径与生成模式\n  3. 点击「生成材质」按钮（如果选择中包含模型，生成的材质会赋予给对应的模型，前提是模型命名规范）\n"
					},
					"Translation": {
						"Text": "Usage:\n  1. Select one or more texture maps in the Content Browser (you can also additionally select one or more models)\n  2. Set the save path and generation mode below\n  3. Click the Generate Material button (if models are included in the selection, the generated material is assigned to the corresponding models, provided the models are named correctly)\n"
					},
					"Key": "Usage"
				},
				{
					"Source": {
						"Text": "使用父材质实例"
					},
					"Translation": {
						"Text": "Use Parent Material Instance"
					},
					"Key": "UseMI"
				},
				{
					"Source": {
						"Text": "保存位置: "
					},
					"Translation": {
						"Text": "Save Location: "
					},
					"Key": "Dst"
				},
				{
					"Source": {
						"Text": "保存到贴图同级目录"
					},
					"Translation": {
						"Text": "Save to the Same Directory as the Texture"
					},
					"Key": "SaveNextToTextures"
				},
				{
					"Source": {
						"Text": "创建实例并应用"
					},
					"Translation": {
						"Text": "Create Instance and Apply"
					},
					"Key": "CreateMI"
				},
				{
					"Source": {
						"Text": "前缀:"
					},
					"Translation": {
						"Text": "Prefix:"
					},
					"Key": "PrefixLabel"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "When checked, ignore the save location above and save the material to the directory of the selected texture"
					},
					"Key": "SaveNextToTexturesTip"
				},
				{
					"Source": {
						"Text": "勾选后忽略上方保存位置，材质球保存到选中贴图所在目录"
					},
					"Translation": {
						"Text": "When checked, ignore the save location above and save the material to the directory of the selected texture"
					},
					"Key": "SaveNextToTexturesTip2"
				},
				{
					"Source": {
						"Text": "后缀:"
					},
					"Translation": {
						"Text": "Suffix:"
					},
					"Key": "SuffixLabel"
				},
				{
					"Source": {
						"Text": "在母材质基础上生成材质实例"
					},
					"Translation": {
						"Text": "Generate a material instance based on the parent material"
					},
					"Key": "CreateMITip"
				},
				{
					"Source": {
						"Text": "如果使用自己自定义的材质球，请根据对应通道填写参数名"
					},
					"Translation": {
						"Text": "If you use your own custom material, please fill in the parameter names according to the corresponding channels"
					},
					"Key": "ParamConfigTip"
				},
				{
					"Source": {
						"Text": "批量材质球生成"
					},
					"Translation": {
						"Text": "Batch Material Generation"
					},
					"Key": "Title"
				},
				{
					"Source": {
						"Text": "本工具将内容浏览器中选中的纹理贴图，根据文件名关键词自动识别贴图通道类型（基础色 / 法线 / ORM / 粗糙度 / 金属度 / 自发光 / 透明度等），并据此生成材质球。"
					},
					"Translation": {
						"Text": "This tool automatically recognizes the texture channel type (Base Color / Normal / ORM / Roughness / Metallic / Emissive / Opacity, etc.) from the selected texture maps in the Content Browser based on filename keywords, and generates a material accordingly."
					},
					"Key": "Desc"
				},
				{
					"Source": {
						"Text": "清空日志"
					},
					"Translation": {
						"Text": "Clear Log"
					},
					"Key": "Clear"
				},
				{
					"Source": {
						"Text": "生成材质"
					},
					"Translation": {
						"Text": "Generate Material"
					},
					"Key": "Generate"
				},
				{
					"Source": {
						"Text": "生成通用父材质及实例"
					},
					"Translation": {
						"Text": "Generate Common Parent Material and Instance"
					},
					"Key": "CreateGenMat"
				},
				{
					"Source": {
						"Text": "自动创建一个带有标准参数(BaseColor, Normal, ORM, AO, Roughness, Metallic 等)\n和静态开关的父材质及其对应的实例，供「使用父材质实例」模式使用。"
					},
					"Translation": {
						"Text": "Automatically create a parent material with standard parameters (BaseColor, Normal, ORM, AO, Roughness, Metallic, etc.)\nand static switches, along with its corresponding instance, for use with the 'Use Parent Material Instance' mode."
					},
					"Key": "CreateGenMatTip"
				},
				{
					"Source": {
						"Text": "贴图参数名配置"
					},
					"Translation": {
						"Text": "Texture Parameter Name Configuration"
					},
					"Key": "ParamConfig"
				},
				{
					"Source": {
						"Text": "资产命名详细规则"
					},
					"Translation": {
						"Text": "Detailed Asset Naming Rules"
					},
					"Key": "NamingRules"
				},
				{
					"Source": {
						"Text": "输入后缀内容..."
					},
					"Translation": {
						"Text": "Enter suffix content..."
					},
					"Key": "SuffixHint"
				},
				{
					"Source": {
						"Text": "选择路径"
					},
					"Translation": {
						"Text": "Select Path"
					},
					"Key": "BrowseDst"
				}
			]
		},
		{
			"Namespace": "Tools",
			"Children": [
				{
					"Source": {
						"Text": "右键菜单操作脚本"
					},
					"Translation": {
						"Text": "Right-click menu operation scripts"
					},
					"Key": "ToolDetail_ContextMenu"
				},
				{
					"Source": {
						"Text": "右键菜单操作脚本"
					},
					"Translation": {
						"Text": "Right-Click Menu Operation Scripts"
					},
					"Key": "ToolTitle_ContextMenu"
				},
				{
					"Source": {
						"Text": "多选两个蓝图的变量（函数，宏等），复制/剪切后一次性粘贴到另一个蓝图"
					},
					"Translation": {
						"Text": "Select variables (functions, macros, etc.) from two blueprints, then copy/cut and paste them all at once into another blueprint"
					},
					"Key": "ToolDetail_VariableCopier"
				},
				{
					"Source": {
						"Text": "常见新蓝图类时自动添加该类前缀"
					},
					"Translation": {
						"Text": "Automatically add the class prefix when creating common new blueprint classes"
					},
					"Key": "ToolDetail_AutoPrefix"
				},
				{
					"Source": {
						"Text": "批量导入模型和材质"
					},
					"Translation": {
						"Text": "Batch Import Models and Materials"
					},
					"Key": "ToolTitle_Import_MM"
				},
				{
					"Source": {
						"Text": "批量导入模型和材质，同文件下的模型以及附属的纹理贴图会自动连接材质球并赋予模型"
					},
					"Translation": {
						"Text": "Batch import models and materials; models in the same file and their accompanying textures will be automatically connected to the material and assigned to the model"
					},
					"Key": "ToolDetail"
				},
				{
					"Source": {
						"Text": "批量材质球生成"
					},
					"Translation": {
						"Text": "Batch Material Creation"
					},
					"Key": "ToolTitle_SpawnMaterial"
				},
				{
					"Source": {
						"Text": "材质属性转移"
					},
					"Translation": {
						"Text": "Material Attribute Transfer"
					},
					"Key": "ToolTitle_MaterialTransfer"
				},
				{
					"Source": {
						"Text": "物理摆放"
					},
					"Translation": {
						"Text": "Physics Placement"
					},
					"Key": "ToolTitle_PhysicsPlacer"
				},
				{
					"Source": {
						"Text": "自动前缀"
					},
					"Translation": {
						"Text": "Auto Prefix"
					},
					"Key": "ToolTitle_AutoPrefix"
				},
				{
					"Source": {
						"Text": "蓝图变量批量复制"
					},
					"Translation": {
						"Text": "Blueprint Variable Batch Copy"
					},
					"Key": "ToolTitle_VariableCopier"
				},
				{
					"Source": {
						"Text": "选中多个场景物体，启动物理自由掉落摆放，并支持保存/回溯摆位"
					},
					"Translation": {
						"Text": "Select multiple scene objects, start physics-based free-fall placement, and support saving/undoing placements"
					},
					"Key": "ToolDetail_PhysicsPlacer"
				},
				{
					"Source": {
						"Text": "选择若干材质球或材质实例并通过变量命名将引用转移到新的材质球或材质实例"
					},
					"Translation": {
						"Text": "Select materials or material instances and transfer their references to new materials or material instances via variable naming"
					},
					"Key": "ToolDetail_MaterialTransfer"
				},
				{
					"Source": {
						"Text": "选择若干纹理生成材质球或材质实例并赋予模型"
					},
					"Translation": {
						"Text": "Select textures to generate material or material instances and assign them to models"
					},
					"Key": "ToolDetail_SpawnMaterial"
				}
			]
		},
		{
			"Namespace": "ToolsBox",
			"Children": [
				{
					"Source": {
						"Text": "工具名称"
					},
					"Translation": {
						"Text": "Tool Name"
					},
					"Key": "SearchHint"
				},
				{
					"Source": {
						"Text": "打开作者页面"
					},
					"Translation": {
						"Text": "Open Author Page"
					},
					"Key": "OpenAuthorURL"
				},
				{
					"Source": {
						"Text": "打开工具"
					},
					"Translation": {
						"Text": "Open Tool"
					},
					"Key": "OpenBtn"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "OpenToolsBox_Command",
					"Children": [
						{
							"Source": {
								"Text": "ToolsBox"
							},
							"Translation": {
								"Text": "Toolbox"
							},
							"Key": "ToolsBox_OpenToolsBox"
						},
						{
							"Source": {
								"Text": "点击打开功能窗口"
							},
							"Translation": {
								"Text": "Click to open the tool window"
							},
							"Key": "ToolsBox_OpenToolsBox_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "VariableCopier",
			"Children": [
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmt"
				},
				{
					"Source": {
						"Text": "{0} ({1})"
					},
					"Translation": {
						"Text": "{0} ({1})"
					},
					"Key": "CatFmtP"
				},
				{
					"Source": {
						"Text": "事件分发器"
					},
					"Translation": {
						"Text": "Event Dispatcher"
					},
					"Key": "NDisp"
				},
				{
					"Source": {
						"Text": "事件图表"
					},
					"Translation": {
						"Text": "Event Graph"
					},
					"Key": "NEnv"
				},
				{
					"Source": {
						"Text": "从待处理区里拿掉这一项"
					},
					"Translation": {
						"Text": "Remove this item from the pending area"
					},
					"Key": "M_DelTip"
				},
				{
					"Source": {
						"Text": "使用方法：\n  1. 两边选择要互相复制的蓝图类（拖动前按住shift为复制，alt为剪切）\n  2. 将要复制或剪切的变量，宏，函数等拖进对方待处理区域内\n  3. 点击 确定 即可生效\n"
					},
					"Translation": {
						"Text": "Usage:\n  1. Select the Blueprint classes to copy between on both sides (hold Shift before dragging to copy, Alt to cut)\n  2. Drag the variables, macros, functions, etc. you want to copy or cut into the other side's pending area\n  3. Click OK to apply\n"
					},
					"Key": "AutoPrefixHelp"
				},
				{
					"Source": {
						"Text": "函数"
					},
					"Translation": {
						"Text": "Functions"
					},
					"Key": "NFn"
				},
				{
					"Source": {
						"Text": "刷新"
					},
					"Translation": {
						"Text": "Refresh"
					},
					"Key": "RefreshBtn"
				},
				{
					"Source": {
						"Text": "剪切"
					},
					"Translation": {
						"Text": "Cut"
					},
					"Key": "M_Cut"
				},
				{
					"Source": {
						"Text": "变量"
					},
					"Translation": {
						"Text": "Variables"
					},
					"Key": "NVar"
				},
				{
					"Source": {
						"Text": "复制"
					},
					"Translation": {
						"Text": "Copy"
					},
					"Key": "M_Copy"
				},
				{
					"Source": {
						"Text": "宏"
					},
					"Translation": {
						"Text": "Macros"
					},
					"Key": "NMacro"
				},
				{
					"Source": {
						"Text": "待处理（拖到这里的，点确定才生效）："
					},
					"Translation": {
						"Text": "Pending (items dragged here take effect only after clicking OK):"
					},
					"Key": "PendingTitle"
				},
				{
					"Source": {
						"Text": "把两个面板待处理里的东西真正写进各自蓝图"
					},
					"Translation": {
						"Text": "Actually write the pending items from both panels into their respective Blueprints"
					},
					"Key": "ConfirmTip"
				},
				{
					"Source": {
						"Text": "清空两个面板的待处理区（不影响蓝图）"
					},
					"Translation": {
						"Text": "Clear the pending areas of both panels (does not affect Blueprints)"
					},
					"Key": "ResetTip"
				},
				{
					"Source": {
						"Text": "确定"
					},
					"Translation": {
						"Text": "OK"
					},
					"Key": "ConfirmBtn"
				},
				{
					"Source": {
						"Text": "移除"
					},
					"Translation": {
						"Text": "Remove"
					},
					"Key": "M_Del"
				},
				{
					"Source": {
						"Text": "这一项应用时会剪切（从源蓝图移除）"
					},
					"Translation": {
						"Text": "This item will be cut when applied (removed from source Blueprint)"
					},
					"Key": "M_CutTip"
				},
				{
					"Source": {
						"Text": "这一项应用时会复制（源蓝图保留）"
					},
					"Translation": {
						"Text": "This item will be copied when applied (source Blueprint retained)"
					},
					"Key": "M_CopyTip"
				},
				{
					"Source": {
						"Text": "重新扫描两个蓝图，检查内容是否变化"
					},
					"Translation": {
						"Text": "Re-scan both Blueprints to check for changes"
					},
					"Key": "RefreshTip"
				},
				{
					"Source": {
						"Text": "重置"
					},
					"Translation": {
						"Text": "Reset"
					},
					"Key": "ResetBtn"
				}
			]
		}
	]
}